{"projects":[
    {"id":1,"title":"Portfolio Manager Application","description":["Successfully built a trading and portfolio management application which performs AI driven technical analysis, risk analysis, backtesting and real-time tracking of: instrument prices, watchlists, positions and portfolios as an active investment management system.", "The front end of this app is implemented with React and React-Redux. Complex UI interactions including Drag and Drop.", "The price data processing in this app is implemented using concepts from Deep Learning, Monte-Carlo simulations and Modern Portfolio Theory."],"link":"","techs":["Python", "TensorFlow","Node","React", "React Redux","Docker","AWS Lambda","Serverless","Socket.io","Databases"]},
    {"id":2,"title":"AI Application of Statistical Characterisation of Excursions at Level Crossings in the Stock Market - MSc project","description":["Achieved designing and founding a new method of Monte Carlo simulation which leverages the underlying mechanisms of Monte Carlo simulations through level crossing methods in order to better predict contextual price ranges.","This is combined with the use of AI to produce intelligently guided simulations for market prediction in terms of direction and volatility. Developed statistical-based trading strategy using confidence intervals and predicted volatility extracted from simulations"],"link":"","techs":["Python", "TensorFlow" ,"NumPy", "SciPy", "Pandas"]},
    {"id":3,"title":"NLP Social Media Sentiment Analysis","description":["A university group project to produce an algorithm which uses twitter and Reddit API’s to scrape social media posts on US companies in order to conduct sentiment analysis using Machine Learning."," The results of the program were used for speculating on the stock market."],"link":"","techs":["Python", "TensorFlow" ,"NumPy", "Flair"]},
    {"id":4,"title":"Social Media Platform","description":["Developed a web application where users create image-based posts about their professional projects. Other users receive and can interact with these posts on their news feed.","Each user can design their custom profile page gallery according to whichever projects they choose to display. Users require login and pages/interactions require a certain level of authentication. This controls what and how users may interact with others in the application"],"link":"","techs":["Node.js" ,"React","Next.js", "MongoDB", "AWS"]},
    {"id":5,"title":"E-Commerce Site","description":["Developed an e-commerce store application where users login, view the catalog, select and put items into their basket and purchase the items. ","Application connected to Stripe API"],"link":"","techs":["React","Firebase" ,"Stripe"]},   
    {"id":6,"title":"MySQL University Library Database Management System (Group Project)","description":["Designed SQL database architecture to 3rd level normalisation as a team.","Implemented views and queries to efficiently navigate a mock dataset."],"link":"","techs":["mySQL"]},
    {"id":7,"title":"Book sharing cloud API development (Group Project)","description":["Developed a fully conforming REST API using Express.js and Mongoose to communicate with a MongoDB database.","Tested with Postman."],"link":"","techs":["Express","Mongoose","Postman"]}

],
"techs":["Python", "Javascript"," AWS","Pandas", "NumPy", "SciPy" ,"Node.js","Next.js" ,"React", "React-Redux","HTML","CSS" ,"Algorithms", "Git","Data Structures" ,"Tensorflow","Databases" ,"SQL", "MongoDB","Firebase", "AdobeXD","Microsoft Office Suite"],
"slides":[
    {"title":"Python","techs":["Machine Learning","CLIs","Scripting","OOP","OOD","Pandas","NumPy","SciPy","Web scraping"]},
    {"title":"API's/Server side","techs":["Node","Express","Mongoose","Prisma","Flask","SQLAlchemy"]},
    {"title":"Frontend","techs":["React","Redux","MUI","HTML","CSS","SASS","Responsive", "UI Design","UX"]},
    {"title":"Cloud Infrastructure","techs":["AWS EC2","AWS Lambda","Elastic Beanstalk","GCP","Docker","Serverless","SQL","MongoDB","Firebase"]}
    
]
}